Documents/ПереносРезервовМеждуСтатьямиФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПереносРезервовМеждуСтатьямиФинансирования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОценочныеОбязательства</xr:Item>
				<xr:Item>AccumulationRegister.ОценочныеОбязательстваПоСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансированияИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценочныеОбязательстваПоСотрудникам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерва</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваСтраховыхВзносов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваСтраховыхВзносовНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваФССНесчастныеСлучаи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРезерваФССНесчастныеСлучаиНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатьиФинансирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереносРезервовМеждуСтатьямиФинансирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СотрудникиИсходные = ОбщегоНазначения.ВыгрузитьКолонку(ОценочныеОбязательстваПоСотрудникам, "Сотрудник");
	СотрудникиСвернутые = ОбщегоНазначения.ВыгрузитьКолонку(ОценочныеОбязательстваПоСотрудникам, "Сотрудник", Истина);
	
	Если СотрудникиИсходные.Количество() <> СотрудникиСвернутые.Количество() Тогда
		Для Каждого ЗначениеМассива Из СотрудникиСвернутые Цикл
			МассивСтрок = ОценочныеОбязательстваПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник", ЗначениеМассива));
			Если МассивСтрок.Количество() > 1 Тогда
				ПереченьСтрок = "";
				Для Каждого СтрокаМассива Из МассивСтрок Цикл
					ПереченьСтрок = ПереченьСтрок + ?(ПереченьСтрок = "", "", ", ") + СтрокаМассива.НомерСтроки;
				КонецЦикла;
				Для Каждого СтрокаМассива Из МассивСтрок Цикл
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='В строках %1 дублируются значения в колонке ""Сотрудник""'"),
						ПереченьСтрок);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОценочныеОбязательстваПоСотрудникам[" + Формат(СтрокаМассива.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Сотрудник", "Объект", Отказ);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИменКолонок = Новый Соответствие;
	СоответствиеИменКолонок.Вставить("СуммаРезерва", НСтр("ru='Обязательство (резерв)'"));
	СоответствиеИменКолонок.Вставить("СуммаРезерваНУ", НСтр("ru='Обязательство (резерв) (НУ)'"));
	СоответствиеИменКолонок.Вставить("СуммаРезерваСтраховыхВзносов", НСтр("ru='Страховые взносы'"));
	СоответствиеИменКолонок.Вставить("СуммаРезерваСтраховыхВзносовНУ", НСтр("ru='Страховые взносы (НУ)'"));
	СоответствиеИменКолонок.Вставить("СуммаРезерваФССНесчастныеСлучаи", НСтр("ru='Травматизм'"));
	СоответствиеИменКолонок.Вставить("СуммаРезерваФССНесчастныеСлучаиНУ", НСтр("ru='Травматизм (НУ)'"));
	
	МассивИменКолонок = Новый Массив;
	Для Каждого ЗаписьСоответствия Из СоответствиеИменКолонок Цикл
		МассивИменКолонок.Добавить(ЗаписьСоответствия.Ключ);
	КонецЦикла;
	
	ОписаниеДокумента = Документы.ПереносРезервовМеждуСтатьямиФинансирования.ОписаниеДокумента();
	ЗаполнитьЗначенияСвойств(ОписаниеДокумента, ЭтотОбъект);
	ОписаниеДокумента.Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(ОценочныеОбязательстваПоСотрудникам, "Сотрудник", Истина);
	ОстатокРезерваУчетный = Документы.ПереносРезервовМеждуСтатьямиФинансирования.РезервыСотрудников(ОписаниеДокумента);
	Для Каждого СтрокаДокумента Из ОценочныеОбязательстваПоСотрудникам Цикл
		СтрокаТаблицы = ОстатокРезерваУчетный.Найти(СтрокаДокумента.Сотрудник, "Сотрудник");
		Если СтрокаТаблицы = Неопределено Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По сотруднику %1 остатки в учете отсутствуют'"),
					СтрокаДокумента.Сотрудник);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОценочныеОбязательстваПоСотрудникам", "Объект", Отказ);
		Иначе
			Для Каждого ИмяПоказателя Из МассивИменКолонок Цикл
				Если СтрокаДокумента[ИмяПоказателя] > СтрокаТаблицы[ИмяПоказателя] Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='В строке %1 по сотруднику %2 в колонке ""%3"" сумма к списанию (%4) превышает доступную сумму остатка (%5)'"),
							СтрокаДокумента.НомерСтроки, СтрокаДокумента.Сотрудник, СоответствиеИменКолонок[ИмяПоказателя],Формат(СтрокаДокумента[ИмяПоказателя], "ЧДЦ=2"), Формат(СтрокаТаблицы[ИмяПоказателя], "ЧДЦ=2"));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ОценочныеОбязательстваПоСотрудникам[" + Формат(СтрокаДокумента.НомерСтроки - 1, "ЧН=0; ЧГ=") + "]." + ИмяПоказателя, "Объект", Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляОтражения = РезервыПоОплатеТруда.СтруктураДанныхДляОтраженияВУчете();
	Документы.ПереносРезервовМеждуСтатьямиФинансирования.ПодготовитьДанныеДляОтраженияВУчете(Ссылка, ДанныеДляОтражения);
	РезервыПоОплатеТруда.СформироватьДвиженияПоНачислениюОбязательств(Движения, Отказ, Организация, Дата, КонецМесяца(ПериодРегистрации), ДанныеДляОтражения);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
